Autodesk.Revit.DB.STEPImportOptions.#ctor(Autodesk.Revit.DB.STEPImportOptions)
Constructs a new instance of STEPImportOptions as a copy of the import options.
option:
The STEP options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024.2

Autodesk.Revit.DB.STEPImportOptions.#ctor
Constructs a new instance of STEPImportOptions with default values of all properties.
Since:
2024.2

Autodesk.Revit.DB.STEPImportOptions
The import options used to import STEP format files.
Since:
2024.2